Repository: gnachman/iTerm2
Catalog: sources/Localizable.xcstrings
Source language: en
Languages: de, ja, pt_br, ru, zh_hans

# EditKeyAction.HelpRemapLocally
source: This action applies modifier remapping but prevents other programs from seeing the keystroke. For example, if you've swapped ⌘ and ^ and want physical ^-tab to switch tabs in iTerm2 instead of triggering the app switcher: bind ^-tab to this action. The system won't see the remapped ⌘-tab (so no app switcher), but iTerm2 receives it and can switch tabs.
de: Diese Aktion wendet die Modifikator-Zuordnung an, verhindert jedoch, dass andere Programme den Tastenanschlag sehen. Wenn Sie beispielsweise ⌘ und ^ vertauscht haben und möchten, dass das physische ^-Tab in iTerm2 die Tabs wechselt, anstatt den App-Wechsler auszulösen: Ordnen Sie ^-Tab dieser Aktion zu. Das System sieht das zugeordnete ⌘-Tab nicht (also kein App-Wechsler), aber iTerm2 empfängt es und kann die Tabs wechseln.
ja: このアクションは修飾キーの再割り当てを適用しますが、他のプログラムにキーストロークが渡らないようにします。たとえば、⌘と^を入れ替えていて、物理的な^-Tabでアプリスイッチャーを起動せずにiTerm2内でタブを切り替えたい場合は、^-Tabをこのアクションに割り当てます。システムには再割り当てされた⌘-Tabが渡らないため（アプリスイッチャーは起動しません）、iTerm2がこれを受け取ってタブを切り替えられます。
pt_br: Esta ação aplica o remapeamento de modificadores mas impede que outros programas vejam a tecla. Por exemplo, se você trocou ⌘ e ^ e quer que o ^-tab físico alterne abas no iTerm2 em vez de acionar o alternador de apps: vincule ^-tab a esta ação. O sistema não verá o ⌘-tab remapeado (então sem alternador de apps), mas o iTerm2 o recebe e pode alternar abas.
ru: Это действие применяет переназначение модификаторов, но не позволяет другим программам видеть нажатие клавиши. Например, если вы поменяли местами ⌘ и ^ и хотите, чтобы физическое сочетание ^-Tab переключало вкладки в iTerm2 вместо вызова переключателя приложений, привяжите ^-Tab к этому действию. Система не увидит переназначенное ⌘-Tab (поэтому переключатель приложений не появится), но iTerm2 получит это сочетание и сможет переключать вкладки.
zh_hans: 此操作应用修饰键重映射，但阻止其他程序看到该按键。例如，如果你交换了 ⌘ 和 ^，并希望物理 ^-Tab 在 iTerm2 中切换标签页而不是触发应用切换器：请将 ^-Tab 绑定到此操作。系统不会看到重映射后的 ⌘-Tab（因此不会出现应用切换器），但 iTerm2 会收到它并可以切换标签页。

# EditKeyAction.HelpVimText
source: Special characters are: * \<1-to-3-digit octal> * \x<1 or 2 digit hex> * \u<4 digit hex> * \b for backspace * \e for esc * \f for formfeed * \n for newline and \r for return * \t for tab * \\ and \" for literal \ and " * <C-x> for control key * <M-x> for meta key.
de: Sonderzeichen sind: * \<1- bis 3-stellig, oktal> * \x<1- oder 2-stellig, hex> * \u<4-stellig, hex> * \b für Backspace * \e für Esc * \f für Seitenvorschub * \n für Zeilenumbruch und \r für Wagenrücklauf * \t für Tabulator * \\ und \" für die Zeichen \ und " * <C-x> für die Steuerungstaste * <M-x> für die Meta-Taste.
ja: 特殊文字は次のとおりです: * \<1〜3桁の8進数> * \x<1桁または2桁の16進数> * \u<4桁の16進数> * バックスペースは\b * エスケープは\e * 改ページは\f * 改行は\n、復帰は\r * タブは\t * \\と\"はそれぞれリテラルの\と"を表します * controlキーには<C-x> * metaキーには<M-x>。
pt_br: Os caracteres especiais são: * \<octal de 1 a 3 dígitos> * \x<hex de 1 ou 2 dígitos> * \u<hex de 4 dígitos> * \b para backspace * \e para esc * \f para formfeed * \n para nova linha e \r para retorno * \t para tabulação * \\ e \" para \ e " literais * <C-x> para a tecla Control * <M-x> para a tecla Meta.
ru: Специальные символы: * \<от 1 до 3 восьмеричных цифр> * \x<1 или 2 шестнадцатеричные цифры> * \u<4 шестнадцатеричные цифры> * \b — забой * \e — escape * \f — перевод страницы * \n — новая строка, \r — возврат каретки * \t — табуляция * \\ и \" для буквальных \ и " * <C-x> для клавиши control * <M-x> для клавиши meta.
zh_hans: 特殊字符包括： * \<1-to-3-digit octal> * \x<1 or 2 digit hex> * \u<4 digit hex> * \b 表示退格 * \e 表示转义 * \f 表示换页 * \n 表示换行，\r 表示回车 * \t 表示制表符 * \\ 和 \" 表示字面反斜杠和引号 * <C-x> 表示 Control 键 * <M-x> 表示 Meta 键。

# EditKeyAction.KeyboardShortcutLabel
source: Keyboard Shortcut:
de: Tastenkombination:
ja: キーボードショートカット:
pt_br: Atalho de teclado:
ru: Сочетание клавиш:
zh_hans: 键盘快捷键：

# EditKeyAction.PlaceholderComposer
source: Text for composer
de: Text für Composer
ja: コンポーザー用のテキスト
pt_br: Texto para o composer
ru: Текст для Композитора
zh_hans: Composer 文本

# EditKeyAction.PlaceholderEscapeChars
source: characters to send
de: zu sendende Zeichen
ja: 送信する文字
pt_br: caracteres a enviar
ru: символы для отправки
zh_hans: 要发送的字符

# EditKeyAction.PlaceholderFunctionCall
source: Function Call
de: Funktionsaufruf
ja: 関数呼び出し
pt_br: Chamada de função
ru: Вызов функции
zh_hans: 函数调用

# EditKeyAction.PlaceholderHexCode
source: ex: 0x7f 0x20
de: z. B.: 0x7f 0x20
ja: 例: 0x7f 0x20
ru: напр.: 0x7f 0x20
zh_hans: 例如：0x7f 0x20

# EditKeyAction.PlaceholderInterpolatedString
source: Enter interpolated string (evaluated in session context)
de: Interpolierten String eingeben (wird im Sitzungskontext ausgewertet)
ja: 補間文字列を入力（セッションのコンテキストで評価されます）
pt_br: Insira a string interpolada (avaliada no contexto da sessão)
ru: Введите интерполированную строку (вычисляется в контексте сеанса)
zh_hans: 输入内插字符串（在会话上下文中求值）

# EditKeyAction.PlaceholderMenuItem
source: Enter name of menu item
de: Namen des Menüpunkts eingeben
ja: メニュー項目名を入力
pt_br: Insira o nome do item de menu
ru: Введите имя пункта меню
zh_hans: 输入菜单项名称

# EditKeyAction.PlaceholderRegex
source: Regular Expression
de: Regulärer Ausdruck
ja: 正規表現
pt_br: Expressão regular
ru: Регулярное выражение
zh_hans: 正则表达式

# EditKeyAction.PlaceholderRunCommand
source: Enter command to run
de: Auszuführenden Befehl eingeben
ja: 実行するコマンドを入力
pt_br: Insira o comando a executar
ru: Введите команду для выполнения
zh_hans: 输入要运行的命令

# EditKeyAction.PlaceholderSendText
source: Enter value to send
de: Zu sendenden Wert eingeben
ja: 送信する値を入力
pt_br: Insira o valor a enviar
ru: Введите значение для отправки
zh_hans: 输入要发送的值

# EditKeyAction.PlaceholderTmuxCommand
source: Enter tmux command
de: tmux-Befehl eingeben
ja: tmuxコマンドを入力
pt_br: Insira o comando tmux
ru: Введите команду tmux
zh_hans: 输入 tmux 命令

# EditKeyAction.PlaceholderVimText
source: Enter value to send. Click help button for special characters.
de: Zu sendenden Wert eingeben. Klicken Sie auf die Hilfe-Schaltfläche für Sonderzeichen.
ja: 送信する値を入力してください。特殊文字についてはヘルプボタンをクリックしてください。
pt_br: Insira o valor a enviar. Clique no botão de ajuda para ver os caracteres especiais.
ru: Введите значение для отправки. Нажмите кнопку справки, чтобы узнать о специальных символах.
zh_hans: 输入要发送的值。点按帮助按钮查看特殊字符。

# EditKeyAction.SelectAction
source: Select Action…
de: Aktion auswählen…
ja: アクションを選択…
pt_br: Selecionar ação…
ru: Выбрать действие…
zh_hans: 选择操作…

# EditKeyAction.Title
source: Title
de: Titel
ja: タイトル
pt_br: Título
ru: Заголовок
zh_hans: 标题

# EditKeyAction.TitleInterpolatedPlaceholder
source: Title (Interpolated String)
de: Titel (interpolierter String)
ja: タイトル（補間文字列）
pt_br: Título (string interpolada)
ru: Заголовок (интерполированная строка)
zh_hans: 标题（内插字符串）

# EditKeyAction.TouchBarLabelPlaceholder
source: Label to show in Touch Bar
de: In der Touch Bar anzuzeigende Bezeichnung
ja: Touch Barに表示するラベル
pt_br: Rótulo a mostrar na Touch Bar
ru: Подпись для отображения на Touch Bar
zh_hans: 要在 Touch Bar 中显示的标签

# EditKeyAction.TouchBarLabelTitle
source: Touch Bar Label
de: Touch-Bar-Bezeichnung
ja: Touch Barのラベル
pt_br: Rótulo da Touch Bar
ru: Подпись Touch Bar
zh_hans: Touch Bar 标签

# EditSnippet.EscapingHelp
source: C-Style Backslash Escaping supports: \a (bell), \b (backspace), \e (escape), \n (newline), \r (carriage return), \t (tab), \\ (backslash), and \x followed by two hex digits giving a single byte of UTF-8. Unescaped Literal Text does not have any special characters. Backward Compatibility Escaping, which is not recommended for new snippets, supports: \n (newline), \e (escape), \a (bell), and \t (tab).
de: C-Stil-Backslash-Escaping unterstützt: \a (Signalton), \b (Backspace), \e (Escape), \n (Zeilenumbruch), \r (Wagenrücklauf), \t (Tabulator), \\ (Backslash) und \x gefolgt von zwei Hexadezimalziffern für ein einzelnes UTF-8-Byte. Nicht maskierter reiner Text enthält keine Sonderzeichen. Abwärtskompatibilitäts-Escaping, das für neue Snippets nicht empfohlen wird, unterstützt: \n (Zeilenumbruch), \e (Escape), \a (Signalton) und \t (Tabulator).
ja: Cスタイルのバックスラッシュエスケープは、\a（ベル）、\b（バックスペース）、\e（エスケープ）、\n（改行）、\r（復帰）、\t（タブ）、\\（バックスラッシュ）、および\xに続く2桁の16進数（UTF-8の1バイトを表す）をサポートします。 「エスケープなしリテラルテキスト」には特殊文字はありません。 「下位互換エスケープ」（新しいスニペットには推奨されません）は、\n（改行）、\e（エスケープ）、\a（ベル）、\t（タブ）をサポートします。
pt_br: O escape de barra invertida estilo C suporta: \a (campainha), \b (backspace), \e (escape), \n (nova linha), \r (retorno de carro), \t (tabulação), \\ (barra invertida) e \x seguido de dois dígitos hexadecimais, representando um único byte de UTF-8. O texto literal sem escape não tem nenhum caractere especial. O escape de compatibilidade retroativa, que não é recomendado para novos fragmentos, suporta: \n (nova linha), \e (escape), \a (campainha) e \t (tabulação).
ru: Экранирование в стиле C поддерживает: \a (звуковой сигнал), \b (забой), \e (escape), \n (новая строка), \r (возврат каретки), \t (табуляция), \\ (обратная косая черта), а также \x, за которым следуют две шестнадцатеричные цифры, задающие один байт UTF-8. Неэкранированный текст не содержит специальных символов. Экранирование для обратной совместимости, которое не рекомендуется использовать для новых сниппетов, поддерживает: \n (новая строка), \e (escape), \a (звуковой сигнал) и \t (табуляция).
zh_hans: C 风格反斜杠转义支持：\a（提示音）、\b（退格）、\e（转义）、\n（换行）、\r（回车）、\t（制表符）、\\（反斜杠），以及 \x 后跟两位十六进制数字以表示单个 UTF-8 字节。 未转义的文本没有任何特殊字符。 不推荐新片段使用的向后兼容转义支持：\n（换行）、\e（转义）、\a（提示音）和 \t（制表符）。

# EditSnippet.Untitled
source: Untitled
de: Unbenannt
ja: 無題
pt_br: Sem título
ru: Без названия
zh_hans: 未命名

# EventMonitorView.CannotCustomize
source: You can't customize that button
de: Diese Schaltfläche kann nicht angepasst werden
ja: そのボタンはカスタマイズできません
pt_br: Você não pode personalizar esse botão
ru: Эту кнопку нельзя настроить
zh_hans: 你不能自定义该按钮

# EventMonitorView.ClickToSetInputFields
source: Click or Tap Here to Set Input Fields
de: Hier klicken oder tippen, um Eingabefelder festzulegen
ja: ここをクリックまたはタップして入力フィールドを設定
pt_br: Clique ou toque aqui para definir os campos de entrada
ru: Нажмите здесь, чтобы задать поля ввода
zh_hans: 点按此处设置输入字段

# EventTrigger.ExitCodeFilter.Any
source: Any
de: Beliebig
ja: 任意
pt_br: Qualquer
ru: Любой
zh_hans: 任意

# EventTrigger.ExitCodeFilter.NonZero
source: Non-Zero (Failure)
de: Ungleich Null (Fehler)
ja: 0以外（失敗）
pt_br: Diferente de zero (falha)
ru: Ненулевой (ошибка)
zh_hans: 非零（失败）

# EventTrigger.ExitCodeFilter.Specific
source: Specific Value…
de: Bestimmter Wert…
ja: 特定の値…
pt_br: Valor específico…
ru: Определённое значение…
zh_hans: 特定值…

# EventTrigger.ExitCodeFilter.Zero
source: Zero (Success)
de: Null (Erfolg)
ja: 0（成功）
pt_br: Zero (sucesso)
ru: Нулевой (успех)
zh_hans: 零（成功）

# EventTrigger.Field.Command
source: Command:
de: Befehl:
ja: コマンド:
pt_br: Comando:
ru: Команда:
zh_hans: 命令：

# EventTrigger.Field.Directory
source: Directory:
de: Verzeichnis:
ja: ディレクトリ:
pt_br: Diretório:
ru: Каталог:
zh_hans: 目录：

# EventTrigger.Field.FireWhen
source: Fire When:
de: Auslösen bei:
ja: 発火条件:
pt_br: Disparar quando:
ru: Срабатывать, когда:
zh_hans: 触发时机：

# EventTrigger.Field.Message
source: Message:
de: Nachricht:
ja: メッセージ:
pt_br: Mensagem:
ru: Сообщение:
zh_hans: 消息：

# EventTrigger.Field.SequenceId
source: Sequence ID:
de: Sequenz-ID:
ja: シーケンスID:
pt_br: ID da sequência:
ru: Идентификатор последовательности:
zh_hans: 序列 ID：

# EventTrigger.Field.Threshold
source: Threshold:
de: Schwellenwert:
ja: しきい値:
pt_br: Limite:
ru: Порог:
zh_hans: 阈值：

# EventTrigger.Field.Timeout
source: Timeout:
de: Zeitlimit:
ja: タイムアウト:
pt_br: Tempo limite:
ru: Тайм-аут:
zh_hans: 超时：

# EventTrigger.Field.User
source: User:
de: Benutzer:
ja: ユーザー:
pt_br: Usuário:
ru: Пользователь:
zh_hans: 用户：

# EventTrigger.Field.Value
source: Value:
de: Wert:
ja: 値:
pt_br: Valor:
ru: Значение:
zh_hans: 值：

# EventTrigger.Help.ActivityAfterIdle
source: Fires when output resumes after being idle.
de: Wird ausgelöst, wenn die Ausgabe nach einer Ruhephase fortgesetzt wird.
ja: アイドル状態の後に出力が再開すると発火します。
pt_br: Dispara quando a saída é retomada após ficar ociosa.
ru: Срабатывает, когда вывод возобновляется после простоя.
zh_hans: 空闲后恢复输出时触发。

# EventTrigger.Help.BellReceived
source: Fires when a terminal bell (\a) is received.
de: Wird ausgelöst, wenn ein Terminal-Signalton (\a) empfangen wird.
ja: ターミナルベル（\a）を受信すると発火します。
pt_br: Dispara quando uma campainha do terminal (\a) é recebida.
ru: Срабатывает при получении звукового сигнала терминала (\a).
zh_hans: 收到终端响铃（\a）时触发。

# EventTrigger.Help.CommandFinished
source: Fires when a command exits. Requires shell integration.
de: Wird ausgelöst, wenn ein Befehl beendet wird. Erfordert Shell-Integration.
ja: コマンドが終了すると発火します。シェル統合が必要です。
pt_br: Dispara quando um comando é encerrado. Requer Shell Integration.
ru: Срабатывает при завершении команды. Требуется интеграция с оболочкой.
zh_hans: 命令退出时触发。需要 Shell 集成。

# EventTrigger.Help.CommandRegex
source: Regular expression to match the command line
de: Regulärer Ausdruck, der der Befehlszeile entsprechen muss
ja: コマンドラインに一致させる正規表現
pt_br: Expressão regular para corresponder à linha de comando
ru: Регулярное выражение для сопоставления с командной строкой
zh_hans: 匹配命令行的正则表达式

# EventTrigger.Help.CustomEscapeSequence
source: Fires when a specific OSC escape sequence is received.
de: Wird ausgelöst, wenn eine bestimmte OSC-Escape-Sequenz empfangen wird.
ja: 特定のOSCエスケープシーケンスを受信すると発火します。
pt_br: Dispara quando uma sequência de escape OSC específica é recebida.
ru: Срабатывает при получении определённой управляющей последовательности OSC.
zh_hans: 收到特定 OSC 转义序列时触发。

# EventTrigger.Help.DirectoryChanged
source: Fires when the working directory changes.
de: Wird ausgelöst, wenn sich das Arbeitsverzeichnis ändert.
ja: 作業ディレクトリが変更されると発火します。
pt_br: Dispara quando o diretório de trabalho muda.
ru: Срабатывает при изменении рабочего каталога.
zh_hans: 工作目录更改时触发。

# EventTrigger.Help.DirectoryRegex
source: Regular expression to match the directory path
de: Regulärer Ausdruck, der dem Verzeichnispfad entsprechen muss
ja: ディレクトリパスに一致させる正規表現
pt_br: Expressão regular para corresponder ao caminho do diretório
ru: Регулярное выражение для сопоставления с путём к каталогу
zh_hans: 匹配目录路径的正则表达式

# EventTrigger.Help.HostChanged
source: Fires when connecting to a different host via SSH.
de: Wird ausgelöst, wenn über SSH eine Verbindung zu einem anderen Host hergestellt wird.
ja: SSH経由で別のホストに接続すると発火します。
pt_br: Dispara ao conectar a outro host via SSH.
ru: Срабатывает при подключении к другому хосту через SSH.
zh_hans: 通过 SSH 连接到另一台主机时触发。

# EventTrigger.Help.HostRegex
source: Regular expression to match the hostname
de: Regulärer Ausdruck, der dem Hostnamen entsprechen muss
ja: ホスト名に一致させる正規表現
pt_br: Expressão regular para corresponder ao nome do host
ru: Регулярное выражение для сопоставления с именем хоста
zh_hans: 匹配主机名的正则表达式

# EventTrigger.Help.Idle
source: Fires when no output is received for the specified duration.
de: Wird ausgelöst, wenn für die angegebene Dauer keine Ausgabe empfangen wird.
ja: 指定した時間出力がないと発火します。
pt_br: Dispara quando nenhuma saída é recebida durante a duração especificada.
ru: Срабатывает, если вывод не поступает в течение указанного времени.
zh_hans: 在指定时长内未收到输出时触发。

# EventTrigger.Help.JobEnded
source: Fires when a process matching the job filter leaves the foreground-job ancestry chain.
de: Wird ausgelöst, wenn ein Prozess, der dem Job-Filter entspricht, die Abstammungskette des Vordergrundprozesses verlässt.
ja: ジョブフィルタに一致するプロセスがフォアグラウンドジョブの祖先チェーンから外れると発火します。
pt_br: Dispara quando um processo que corresponde ao filtro de processo deixa a cadeia de ancestralidade do processo em primeiro plano.
ru: Срабатывает, когда процесс, соответствующий фильтру процессов, покидает цепочку предков активного процесса.
zh_hans: 匹配作业过滤器的进程离开前台作业祖先链时触发。

# EventTrigger.Help.JobName
source: Process name to match in the foreground-job ancestry chain (case-insensitive)
de: Prozessname, der in der Abstammungskette des Vordergrundprozesses übereinstimmen muss (Groß-/Kleinschreibung wird nicht beachtet)
ja: フォアグラウンドジョブの祖先チェーン内で一致させるプロセス名（大文字小文字を区別しない）
pt_br: Nome do processo a corresponder na cadeia de ancestralidade do processo em primeiro plano (não diferencia maiúsculas de minúsculas)
ru: Имя процесса для сопоставления в цепочке предков активного процесса (без учёта регистра)
zh_hans: 在前台任务祖先链中要匹配的进程名称（不区分大小写）

# EventTrigger.Help.JobStarted
source: Fires when a process matching the job filter enters the foreground-job ancestry chain.
de: Wird ausgelöst, wenn ein Prozess, der dem Job-Filter entspricht, in die Abstammungskette des Vordergrundprozesses eintritt.
ja: ジョブフィルタに一致するプロセスがフォアグラウンドジョブの祖先チェーンに入ると発火します。
pt_br: Dispara quando um processo que corresponde ao filtro de processo entra na cadeia de ancestralidade do processo em primeiro plano.
ru: Срабатывает, когда процесс, соответствующий фильтру процессов, входит в цепочку предков активного процесса.
zh_hans: 匹配作业过滤器的进程进入前台作业祖先链时触发。

# EventTrigger.Help.LongRunningCommand
source: Fires when a command runs longer than the threshold.
de: Wird ausgelöst, wenn ein Befehl länger als der Schwellenwert läuft.
ja: コマンドの実行時間がしきい値を超えると発火します。
pt_br: Dispara quando um comando é executado por mais tempo que o limite.
ru: Срабатывает, если команда выполняется дольше порогового значения.
zh_hans: 命令运行时间超过阈值时触发。

# EventTrigger.Help.NotificationPosted
source: Fires when a notification is posted by a control sequence (OSC 9).
de: Wird ausgelöst, wenn eine Benachrichtigung durch eine Steuersequenz (OSC 9) gesendet wird.
ja: 制御シーケンス（OSC 9）によって通知が投稿されると発火します。
pt_br: Dispara quando uma notificação é emitida por uma sequência de controle (OSC 9).
ru: Срабатывает при отправке уведомления управляющей последовательностью (OSC 9).
zh_hans: 控制序列（OSC 9）发出通知时触发。

# EventTrigger.Help.NotificationRegex
source: Regular expression to match the notification message
de: Regulärer Ausdruck, der der Benachrichtigungsnachricht entsprechen muss
ja: 通知メッセージに一致させる正規表現
pt_br: Expressão regular para corresponder à mensagem de notificação
ru: Регулярное выражение для сопоставления с текстом уведомления
zh_hans: 匹配通知消息的正则表达式

# EventTrigger.Help.ProgressBarChanged
source: Fires when a progress bar appears or disappears.
de: Wird ausgelöst, wenn ein Fortschrittsbalken erscheint oder verschwindet.
ja: プログレスバーが表示または非表示になると発火します。
pt_br: Dispara quando uma barra de progresso aparece ou desaparece.
ru: Срабатывает при появлении или исчезновении индикатора выполнения.
zh_hans: 进度条出现或消失时触发。

# EventTrigger.Help.PromptDetected
source: Fires when shell integration detects a new prompt.
de: Wird ausgelöst, wenn die Shell-Integration eine neue Eingabeaufforderung erkennt.
ja: シェル統合が新しいプロンプトを検出すると発火します。
pt_br: Dispara quando a Shell Integration detecta um novo prompt.
ru: Срабатывает, когда интеграция с оболочкой обнаруживает новое приглашение.
zh_hans: Shell 集成检测到新提示符时触发。

# EventTrigger.Help.SequenceIdRegex
source: Regular expression to match the sequence identifier
de: Regulärer Ausdruck, der der Sequenz-ID entsprechen muss
ja: シーケンス識別子に一致させる正規表現
pt_br: Expressão regular para corresponder ao identificador da sequência
ru: Регулярное выражение для сопоставления с идентификатором последовательности
zh_hans: 匹配序列标识符的正则表达式

# EventTrigger.Help.SessionEnded
source: Fires when the session terminates.
de: Wird ausgelöst, wenn die Sitzung beendet wird.
ja: セッションが終了すると発火します。
pt_br: Dispara quando a sessão termina.
ru: Срабатывает при завершении сеанса.
zh_hans: 会话终止时触发。

# EventTrigger.Help.UserChanged
source: Fires when the current user changes (su/sudo).
de: Wird ausgelöst, wenn sich der aktuelle Benutzer ändert (su/sudo).
ja: 現在のユーザーが変わると発火します（su/sudo）。
pt_br: Dispara quando o usuário atual muda (su/sudo).
ru: Срабатывает при смене текущего пользователя (su/sudo).
zh_hans: 当前用户更改时触发（su/sudo）。

# EventTrigger.Help.UserRegex
source: Regular expression to match the username
de: Regulärer Ausdruck, der dem Benutzernamen entsprechen muss
ja: ユーザー名に一致させる正規表現
pt_br: Expressão regular para corresponder ao nome de usuário
ru: Регулярное выражение для сопоставления с именем пользователя
zh_hans: 匹配用户名的正则表达式

# EventTrigger.Help.VariableChanged
source: Fires when a session variable changes to a value matching the regex.
de: Wird ausgelöst, wenn sich eine Sitzungsvariable auf einen Wert ändert, der dem regulären Ausdruck entspricht.
ja: セッション変数が正規表現に一致する値に変わると発火します。
pt_br: Dispara quando uma variável de sessão muda para um valor que corresponde à expressão regular.
ru: Срабатывает, когда значение переменной сеанса изменяется на значение, соответствующее регулярному выражению.
zh_hans: 会话变量更改为匹配正则表达式的值时触发。

# EventTrigger.Help.VariableName
source: Name of the session variable to watch
de: Name der zu überwachenden Sitzungsvariable
ja: 監視するセッション変数の名前
pt_br: Nome da variável de sessão a monitorar
ru: Имя переменной сеанса для отслеживания
zh_hans: 要监视的会话变量名称

# EventTrigger.Help.VariableValueRegex
source: Regular expression the new value must match (leave blank to match any change)
de: Regulärer Ausdruck, dem der neue Wert entsprechen muss (leer lassen, um jede Änderung zu erfassen)
ja: 新しい値が一致すべき正規表現（空欄にするとすべての変更に一致します）
pt_br: Expressão regular que o novo valor deve corresponder (deixe em branco para corresponder a qualquer mudança)
ru: Регулярное выражение, которому должно соответствовать новое значение (оставьте пустым, чтобы учитывать любое изменение)
zh_hans: 新值必须匹配的正则表达式（留空以匹配任何更改）

# EventTrigger.Name.ActivityAfterIdle
source: Activity After Idle
de: Aktivität nach Ruhephase
ja: アイドル後のアクティビティ
pt_br: Atividade após inatividade
ru: Активность после простоя
zh_hans: 空闲后的活动

# EventTrigger.Name.BellReceived
source: Bell Received
de: Signalton empfangen
ja: ベルを受信
pt_br: Campainha recebida
ru: Получен звуковой сигнал
zh_hans: 收到响铃

# EventTrigger.Name.CommandFinished
source: Command Finished
de: Befehl beendet
ja: コマンド終了
pt_br: Comando concluído
ru: Команда завершена
zh_hans: 命令完成

# EventTrigger.Name.CustomEscapeSequence
source: Custom Escape Sequence
de: Benutzerdefinierte Escape-Sequenz
ja: カスタムエスケープシーケンス
pt_br: Sequência de escape personalizada
ru: Пользовательская управляющая последовательность
zh_hans: 自定义转义序列

# EventTrigger.Name.DirectoryChanged
source: Directory Changed
de: Verzeichnis geändert
ja: ディレクトリの変更
pt_br: Diretório alterado
ru: Каталог изменён
zh_hans: 目录变更

# EventTrigger.Name.HostChanged
source: Host Changed
de: Host geändert
ja: ホストの変更
pt_br: Host alterado
ru: Хост изменён
zh_hans: 主机变更

# EventTrigger.Name.Idle
source: Idle (Silence)
de: Ruhezustand (Stille)
ja: アイドル（無音）
pt_br: Inativo (silêncio)
ru: Простой (тишина)
zh_hans: 空闲状态（静音）

# EventTrigger.Name.JobEnded
source: Job Ended
de: Job beendet
ja: ジョブ終了
pt_br: Processo terminado
ru: Процесс завершён
zh_hans: 任务结束

# EventTrigger.Name.JobStarted
source: Job Started
de: Job gestartet
ja: ジョブ開始
pt_br: Processo iniciado
ru: Процесс запущен
zh_hans: 任务开始

# EventTrigger.Name.LongRunningCommand
source: Long-Running Command
de: Lang laufender Befehl
ja: 長時間実行コマンド
pt_br: Comando de longa duração
ru: Долго выполняющаяся команда
zh_hans: 长时间运行的命令

# EventTrigger.Name.NotificationPosted
source: Notification Posted
de: Benachrichtigung gesendet
ja: 通知の投稿
pt_br: Notificação publicada
ru: Отправлено уведомление
zh_hans: 通知已发布

# EventTrigger.Name.ProgressBarChanged
source: Progress Bar Changed
de: Fortschrittsbalken geändert
ja: プログレスバーの変化
pt_br: Barra de progresso alterada
ru: Индикатор выполнения изменён
zh_hans: 进度条已更改

# EventTrigger.Name.PromptDetected
source: Prompt Detected
de: Eingabeaufforderung erkannt
ja: プロンプトを検出
pt_br: Prompt detectado
ru: Обнаружено приглашение
zh_hans: 提示符被检测到

# EventTrigger.Name.SessionEnded
source: Session Ended
de: Sitzung beendet
ja: セッション終了
pt_br: Sessão encerrada
ru: Сеанс завершён
zh_hans: 会话已结束
